# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\doug_000\Documents\GitHub\ODAS\ODAS-PSOC5\ODAS-PSOC5-01\ODAS-PSOC5\ODAS-PSOC5-01.cydsn\ODAS-PSOC5-01.cyprj
# Date: Sat, 10 Dec 2016 15:17:32 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 6000001 12000001} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\doug_000\Documents\GitHub\ODAS\ODAS-PSOC5\ODAS-PSOC5-01\ODAS-PSOC5\ODAS-PSOC5-01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\doug_000\Documents\GitHub\ODAS\ODAS-PSOC5\ODAS-PSOC5-01\ODAS-PSOC5\ODAS-PSOC5-01.cydsn\ODAS-PSOC5-01.cyprj
# Date: Sat, 10 Dec 2016 15:17:18 GMT
